In [1]:

import pandas as pd
import numpy as np

In [2]:
athlete = pd.read_excel('/Users/nikita/My_jupyter_data/olympics_kaggle/Athletes.xlsx')
athlete

                        Name      NOC           Discipline
0            AALERUD Katrine   Norway         Cycling Road
1                ABAD Nestor    Spain  Artistic Gymnastics
2          ABAGNALE Giovanni    Italy               Rowing
3             ABALDE Alberto    Spain           Basketball
4              ABALDE Tamara    Spain           Basketball
...                      ...      ...                  ...
11080  ZWICKER Martin Detlef  Germany               Hockey
11081      ZWOLINSKA Klaudia   Poland         Canoe Slalom
11082           ZYKOVA Yulia      ROC             Shooting
11083      ZYUZINA Ekaterina      ROC              Sailing
11084        ZYZANSKA Sylwia   Poland              Archery

[11085 rows x 3 columns]

In [3]:
athlete.shape

(11085, 3)

In [4]:
athlete.isnull().sum()

Name          0
NOC           0
Discipline    0
dtype: int64

In [5]:
athlete['Name'].nunique()

11062

In [6]:
athlete['NOC'].nunique()

206

In [7]:
athlete['Discipline'].nunique()

46

In [8]:
athlete.drop_duplicates(inplace = True)

In [9]:
athlete['NOC'].unique()

array(['Norway', 'Spain', 'Italy', 'France', 'Chile', 'Sudan',
       'Islamic Republic of Iran', 'Azerbaijan', 'Netherlands',
       'Australia', 'United States of America', 'Qatar', 'Egypt',
       'Belgium', 'Malaysia', 'Singapore', 'Maldives', 'Saudi Arabia',
       'Germany', 'Uzbekistan', 'Indonesia', 'Kazakhstan', 'Bahrain',
       'Japan', 'Ethiopia', 'Canada', 'Malta', 'Sri Lanka', 'Morocco',
       'Austria', 'Mauritania', 'ROC', 'Libya', 'Nauru', 'Switzerland',
       'South Africa', 'Guyana', 'Georgia', 'Portugal', 'Jordan',
       'Palestine', 'India', 'Cyprus', 'Nigeria', 'Tunisia', 'Mexico',
       'Colombia', 'El Salvador', 'Romania', 'Poland',
       'Federated States of Micronesia', 'Brazil', 'Turkey', 'Sweden',
       'Great Britain', 'Hungary', 'Lithuania', 'Puerto Rico', 'Angola',
       'Congo', 'Monaco', 'Rwanda', 'Kenya', 'Armenia', 'Samoa',
       'Brunei Darussalam', 'Bangladesh', 'Benin', "Côte d'Ivoire",
       'Trinidad and Tobago', "People's Republic of China", 'Senegal',
       'Algeria', 'Tajikistan', 'Pakistan', 'Kyrgyzstan', 'Latvia',
       'Oman', 'Kuwait', 'Iraq', 'Refugee Olympic Team', 'Yemen', 'Cuba',
       'Argentina', 'Serbia', 'Ukraine', 'Niger', 'Djibouti', 'Somalia',
       'Bulgaria', 'Bermuda', 'Ireland', 'Jamaica', 'Estonia',
       'United Arab Emirates', 'Israel', 'Paraguay', 'Costa Rica',
       'Dominican Republic', 'Honduras', 'Cape Verde', 'Greece',
       'Venezuela', 'Uganda', 'Peru', 'Belarus', 'San Marino', 'Ghana',
       'Ecuador', 'Botswana', 'Republic of Korea', 'New Zealand',
       'Bahamas', 'Denmark', 'Philippines', 'Guam', 'Madagascar', 'Haiti',
       'Czech Republic', 'Montenegro', 'Afghanistan', 'Uruguay', 'Panama',
       'Finland', 'Cameroon', 'Syrian Arab Republic', 'Turkmenistan',
       'Hong Kong, China', 'Togo', 'Seychelles', 'Mongolia', 'Slovenia',
       'Guinea', 'Slovakia', 'Fiji', 'Zambia', 'Nicaragua',
       'Sierra Leone', 'Guatemala', 'Papua New Guinea', 'Gambia',
       'Lebanon', 'Cook Islands', 'Barbados', 'Luxembourg',
       'Republic of Moldova', 'Nepal', 'Croatia', 'Kiribati',
       'North Macedonia', 'Malawi', 'Democratic Republic of the Congo',
       "Lao People's Democratic Republic", 'Thailand',
       'St Vincent and the Grenadines', 'Albania', 'Guinea-Bissau',
       'Bolivia', 'Bosnia and Herzegovina', 'Chinese Taipei',
       'Saint Lucia', 'Palau', 'Mauritius', 'Saint Kitts and Nevis',
       'Cayman Islands', 'American Samoa', 'Belize', 'Vanuatu',
       'Virgin Islands, US', 'Sao Tome and Principe',
       'Democratic Republic of Timor-Leste', 'Eritrea', 'Mali',
       'Burkina Faso', 'Tonga', 'Namibia', 'Vietnam', 'Eswatini',
       'Andorra', 'Aruba', 'Comoros', 'Equatorial Guinea', 'Liberia',
       'Grenada', 'Solomon Islands', 'Marshall Islands', 'Burundi',
       'United Republic of Tanzania', 'Gabon', 'Kosovo',
       'Antigua and Barbuda', 'Mozambique', 'Iceland', 'South Sudan',
       'Liechtenstein', 'Cambodia', 'Chad', 'Bhutan', 'Zimbabwe',
       'Lesotho', 'Dominica', 'Tuvalu', 'Virgin Islands, British',
       'Central African Republic', 'Myanmar', 'Suriname'], dtype=object)

In [10]:
def handle_rep(value):
    return(value.replace('Republic of ', ''))

In [11]:
athlete['NOC'] = athlete['NOC'].apply(handle_rep)

In [12]:
athlete['NOC'].unique()

array(['Norway', 'Spain', 'Italy', 'France', 'Chile', 'Sudan',
       'Islamic Iran', 'Azerbaijan', 'Netherlands', 'Australia',
       'United States of America', 'Qatar', 'Egypt', 'Belgium',
       'Malaysia', 'Singapore', 'Maldives', 'Saudi Arabia', 'Germany',
       'Uzbekistan', 'Indonesia', 'Kazakhstan', 'Bahrain', 'Japan',
       'Ethiopia', 'Canada', 'Malta', 'Sri Lanka', 'Morocco', 'Austria',
       'Mauritania', 'ROC', 'Libya', 'Nauru', 'Switzerland',
       'South Africa', 'Guyana', 'Georgia', 'Portugal', 'Jordan',
       'Palestine', 'India', 'Cyprus', 'Nigeria', 'Tunisia', 'Mexico',
       'Colombia', 'El Salvador', 'Romania', 'Poland',
       'Federated States of Micronesia', 'Brazil', 'Turkey', 'Sweden',
       'Great Britain', 'Hungary', 'Lithuania', 'Puerto Rico', 'Angola',
       'Congo', 'Monaco', 'Rwanda', 'Kenya', 'Armenia', 'Samoa',
       'Brunei Darussalam', 'Bangladesh', 'Benin', "Côte d'Ivoire",
       'Trinidad and Tobago', "People's China", 'Senegal', 'Algeria',
       'Tajikistan', 'Pakistan', 'Kyrgyzstan', 'Latvia', 'Oman', 'Kuwait',
       'Iraq', 'Refugee Olympic Team', 'Yemen', 'Cuba', 'Argentina',
       'Serbia', 'Ukraine', 'Niger', 'Djibouti', 'Somalia', 'Bulgaria',
       'Bermuda', 'Ireland', 'Jamaica', 'Estonia', 'United Arab Emirates',
       'Israel', 'Paraguay', 'Costa Rica', 'Dominican Republic',
       'Honduras', 'Cape Verde', 'Greece', 'Venezuela', 'Uganda', 'Peru',
       'Belarus', 'San Marino', 'Ghana', 'Ecuador', 'Botswana', 'Korea',
       'New Zealand', 'Bahamas', 'Denmark', 'Philippines', 'Guam',
       'Madagascar', 'Haiti', 'Czech Republic', 'Montenegro',
       'Afghanistan', 'Uruguay', 'Panama', 'Finland', 'Cameroon',
       'Syrian Arab Republic', 'Turkmenistan', 'Hong Kong, China', 'Togo',
       'Seychelles', 'Mongolia', 'Slovenia', 'Guinea', 'Slovakia', 'Fiji',
       'Zambia', 'Nicaragua', 'Sierra Leone', 'Guatemala',
       'Papua New Guinea', 'Gambia', 'Lebanon', 'Cook Islands',
       'Barbados', 'Luxembourg', 'Moldova', 'Nepal', 'Croatia',
       'Kiribati', 'North Macedonia', 'Malawi', 'Democratic the Congo',
       "Lao People's Democratic Republic", 'Thailand',
       'St Vincent and the Grenadines', 'Albania', 'Guinea-Bissau',
       'Bolivia', 'Bosnia and Herzegovina', 'Chinese Taipei',
       'Saint Lucia', 'Palau', 'Mauritius', 'Saint Kitts and Nevis',
       'Cayman Islands', 'American Samoa', 'Belize', 'Vanuatu',
       'Virgin Islands, US', 'Sao Tome and Principe',
       'Democratic Timor-Leste', 'Eritrea', 'Mali', 'Burkina Faso',
       'Tonga', 'Namibia', 'Vietnam', 'Eswatini', 'Andorra', 'Aruba',
       'Comoros', 'Equatorial Guinea', 'Liberia', 'Grenada',
       'Solomon Islands', 'Marshall Islands', 'Burundi',
       'United Tanzania', 'Gabon', 'Kosovo', 'Antigua and Barbuda',
       'Mozambique', 'Iceland', 'South Sudan', 'Liechtenstein',
       'Cambodia', 'Chad', 'Bhutan', 'Zimbabwe', 'Lesotho', 'Dominica',
       'Tuvalu', 'Virgin Islands, British', 'Central African Republic',
       'Myanmar', 'Suriname'], dtype=object)

In [13]:
athlete['NOC'] = athlete['NOC'].replace('Islamic Iran', 'Iran')

In [14]:
athlete['NOC'] = athlete['NOC'].replace("People's China", "China")

In [15]:
athlete['NOC'].unique()

array(['Norway', 'Spain', 'Italy', 'France', 'Chile', 'Sudan', 'Iran',
       'Azerbaijan', 'Netherlands', 'Australia',
       'United States of America', 'Qatar', 'Egypt', 'Belgium',
       'Malaysia', 'Singapore', 'Maldives', 'Saudi Arabia', 'Germany',
       'Uzbekistan', 'Indonesia', 'Kazakhstan', 'Bahrain', 'Japan',
       'Ethiopia', 'Canada', 'Malta', 'Sri Lanka', 'Morocco', 'Austria',
       'Mauritania', 'ROC', 'Libya', 'Nauru', 'Switzerland',
       'South Africa', 'Guyana', 'Georgia', 'Portugal', 'Jordan',
       'Palestine', 'India', 'Cyprus', 'Nigeria', 'Tunisia', 'Mexico',
       'Colombia', 'El Salvador', 'Romania', 'Poland',
       'Federated States of Micronesia', 'Brazil', 'Turkey', 'Sweden',
       'Great Britain', 'Hungary', 'Lithuania', 'Puerto Rico', 'Angola',
       'Congo', 'Monaco', 'Rwanda', 'Kenya', 'Armenia', 'Samoa',
       'Brunei Darussalam', 'Bangladesh', 'Benin', "Côte d'Ivoire",
       'Trinidad and Tobago', 'China', 'Senegal', 'Algeria', 'Tajikistan',
       'Pakistan', 'Kyrgyzstan', 'Latvia', 'Oman', 'Kuwait', 'Iraq',
       'Refugee Olympic Team', 'Yemen', 'Cuba', 'Argentina', 'Serbia',
       'Ukraine', 'Niger', 'Djibouti', 'Somalia', 'Bulgaria', 'Bermuda',
       'Ireland', 'Jamaica', 'Estonia', 'United Arab Emirates', 'Israel',
       'Paraguay', 'Costa Rica', 'Dominican Republic', 'Honduras',
       'Cape Verde', 'Greece', 'Venezuela', 'Uganda', 'Peru', 'Belarus',
       'San Marino', 'Ghana', 'Ecuador', 'Botswana', 'Korea',
       'New Zealand', 'Bahamas', 'Denmark', 'Philippines', 'Guam',
       'Madagascar', 'Haiti', 'Czech Republic', 'Montenegro',
       'Afghanistan', 'Uruguay', 'Panama', 'Finland', 'Cameroon',
       'Syrian Arab Republic', 'Turkmenistan', 'Hong Kong, China', 'Togo',
       'Seychelles', 'Mongolia', 'Slovenia', 'Guinea', 'Slovakia', 'Fiji',
       'Zambia', 'Nicaragua', 'Sierra Leone', 'Guatemala',
       'Papua New Guinea', 'Gambia', 'Lebanon', 'Cook Islands',
       'Barbados', 'Luxembourg', 'Moldova', 'Nepal', 'Croatia',
       'Kiribati', 'North Macedonia', 'Malawi', 'Democratic the Congo',
       "Lao People's Democratic Republic", 'Thailand',
       'St Vincent and the Grenadines', 'Albania', 'Guinea-Bissau',
       'Bolivia', 'Bosnia and Herzegovina', 'Chinese Taipei',
       'Saint Lucia', 'Palau', 'Mauritius', 'Saint Kitts and Nevis',
       'Cayman Islands', 'American Samoa', 'Belize', 'Vanuatu',
       'Virgin Islands, US', 'Sao Tome and Principe',
       'Democratic Timor-Leste', 'Eritrea', 'Mali', 'Burkina Faso',
       'Tonga', 'Namibia', 'Vietnam', 'Eswatini', 'Andorra', 'Aruba',
       'Comoros', 'Equatorial Guinea', 'Liberia', 'Grenada',
       'Solomon Islands', 'Marshall Islands', 'Burundi',
       'United Tanzania', 'Gabon', 'Kosovo', 'Antigua and Barbuda',
       'Mozambique', 'Iceland', 'South Sudan', 'Liechtenstein',
       'Cambodia', 'Chad', 'Bhutan', 'Zimbabwe', 'Lesotho', 'Dominica',
       'Tuvalu', 'Virgin Islands, British', 'Central African Republic',
       'Myanmar', 'Suriname'], dtype=object)

In [16]:
athlete.head()

                Name     NOC           Discipline
0    AALERUD Katrine  Norway         Cycling Road
1        ABAD Nestor   Spain  Artistic Gymnastics
2  ABAGNALE Giovanni   Italy               Rowing
3     ABALDE Alberto   Spain           Basketball
4      ABALDE Tamara   Spain           Basketball

In [17]:
athlete['Name'].value_counts()

ZHANG Xin              2
KOPECKY Lotte          2
HALL James             2
MARTIN Daniel          2
DYGERT Chloe           2
                      ..
SHVEDOVA Yaroslava     1
BENOOT Tiesj           1
MICIC Stevan Andria    1
KIPSANG Abel           1
LEE Kareena            1
Name: Name, Length: 11062, dtype: int64

In [18]:
athlete['NOC'].value_counts()

United States of America    615
Japan                       586
Australia                   470
China                       401
Germany                     400
                           ...
Somalia                       2
Saint Kitts and Nevis         2
Marshall Islands              2
Dominica                      2
Brunei Darussalam             2
Name: NOC, Length: 206, dtype: int64

In [19]:
athlete['Discipline'].value_counts()

Athletics                2068
Swimming                  743
Football                  567
Rowing                    496
Hockey                    406
Judo                      373
Shooting                  342
Handball                  342
Sailing                   336
Rugby Sevens              283
Basketball                280
Wrestling                 279
Volleyball                274
Boxing                    270
Water Polo                269
Fencing                   249
Equestrian                237
Canoe Sprint              236
Baseball/Softball         220
Cycling Track             208
Cycling Road              190
Artistic Gymnastics       187
Weightlifting             187
Tennis                    178
Table Tennis              164
Badminton                 164
Diving                    133
Taekwondo                 123
Archery                   122
Golf                      115
Triathlon                 106
Artistic Swimming          98
Rhythmic Gymnastics        95
Beach Volleyball           90
Canoe Slalom               78
Karate                     77
Skateboarding              77
Cycling Mountain Bike      74
Modern Pentathlon          69
3x3 Basketball             62
Marathon Swimming          49
Cycling BMX Racing         43
Surfing                    38
Sport Climbing             37
Trampoline Gymnastics      31
Cycling BMX Freestyle      19
Name: Discipline, dtype: int64

In [20]:
athlete.loc[athlete['NOC'] == 'India'].count()

Name          117
NOC           117
Discipline    117
dtype: int64

### Loading coaches table

In [21]:
coach = pd.read_excel('/Users/nikita/My_jupyter_data/olympics_kaggle/Coaches.xlsx')
coach

,Name,NOC,Discipline,Event
0,ABDELMAGID Wael,Egypt,Football,NaN
1,ABE Junya,Japan,Volleyball,NaN
2,ABE Katsuhiko,Japan,Basketball,NaN
3,ADAMA Cherif,Côte d'Ivoire,Football,NaN
4,AGEBA Yuya,Japan,Volleyball,NaN
...,...,...,...,...
389,ZAMORA PEDREIRA Javier,Spain,Basketball,NaN
390,ZAMPIERI Francesca,Liechtenstein,Artistic Swimming,Duet
391,ZHANG Xiaohuan,People's Republic of China,Artistic Swimming,NaN
392,ZIJP Simon,Netherlands,Hockey,NaN
393,ZONDI Nkuliso,South Africa,Hockey,Women

In [22]:
coach.shape

(394, 4)

In [23]:
coach.isnull().sum()

Name            0
NOC             0
Discipline      0
Event         145
dtype: int64

In [24]:
coach['Name'].nunique()

381

In [25]:
coach['NOC'].unique()

array(['Egypt', 'Japan', "Côte d'Ivoire", 'Germany', 'Canada',
       'Islamic Republic of Iran', 'ROC', 'Spain', 'Saudi Arabia',
       'Puerto Rico', 'United States of America', 'Netherlands',
       'Australia', 'Sweden', 'Fiji', 'Romania', 'Poland',
       "People's Republic of China", 'Great Britain', 'Argentina',
       'Serbia', 'Norway', 'India', 'Hungary', 'Israel', 'Italy',
       'Nigeria', 'Brazil', 'Austria', 'New Zealand', 'Mexico', 'Chile',
       'Greece', 'San Marino', 'Republic of Korea', 'France', 'Belgium',
       'Colombia', 'Angola', 'Ireland', 'Kenya', 'Kazakhstan',
       'Dominican Republic', 'Slovenia', 'Venezuela', 'South Africa',
       'Honduras', 'Ukraine', 'Tunisia', 'Czech Republic', 'Montenegro',
       'Turkey', 'Denmark', 'Cambodia', 'Zambia', 'Bahrain', 'Portugal',
       'Belarus', 'Slovakia', 'Croatia', 'Liechtenstein'], dtype=object)

In [26]:
def handle_rep(value):
    return(value.replace('Republic of ', ''))

coach['NOC'] = coach['NOC'].apply(handle_rep)

In [27]:
coach['NOC'] = coach['NOC'].replace('Islamic Iran', 'Iran')
coach['NOC'] = coach['NOC'].replace("People's China", "China")

In [28]:
coach['NOC'].unique()

array(['Egypt', 'Japan', "Côte d'Ivoire", 'Germany', 'Canada', 'Iran',
       'ROC', 'Spain', 'Saudi Arabia', 'Puerto Rico',
       'United States of America', 'Netherlands', 'Australia', 'Sweden',
       'Fiji', 'Romania', 'Poland', 'China', 'Great Britain', 'Argentina',
       'Serbia', 'Norway', 'India', 'Hungary', 'Israel', 'Italy',
       'Nigeria', 'Brazil', 'Austria', 'New Zealand', 'Mexico', 'Chile',
       'Greece', 'San Marino', 'Korea', 'France', 'Belgium', 'Colombia',
       'Angola', 'Ireland', 'Kenya', 'Kazakhstan', 'Dominican Republic',
       'Slovenia', 'Venezuela', 'South Africa', 'Honduras', 'Ukraine',
       'Tunisia', 'Czech Republic', 'Montenegro', 'Turkey', 'Denmark',
       'Cambodia', 'Zambia', 'Bahrain', 'Portugal', 'Belarus', 'Slovakia',
       'Croatia', 'Liechtenstein'], dtype=object)

In [29]:
coach = coach.drop(['Event'], axis = 1)

In [30]:
coach.isnull().sum()

Name          0
NOC           0
Discipline    0
dtype: int64

### Loading EntriesGender table

In [31]:
gen = pd.read_excel('/Users/nikita/My_jupyter_data/olympics_kaggle/EntriesGender.xlsx')
gen

               Discipline  Female  Male  Total
0          3x3 Basketball      32    32     64
1                 Archery      64    64    128
2     Artistic Gymnastics      98    98    196
3       Artistic Swimming     105     0    105
4               Athletics     969  1072   2041
5               Badminton      86    87    173
6       Baseball/Softball      90   144    234
7              Basketball     144   144    288
8        Beach Volleyball      48    48     96
9                  Boxing     102   187    289
10           Canoe Slalom      41    41     82
11           Canoe Sprint     123   126    249
12  Cycling BMX Freestyle      10     9     19
13     Cycling BMX Racing      24    24     48
14  Cycling Mountain Bike      38    38     76
15           Cycling Road      70   131    201
16          Cycling Track      90    99    189
17                 Diving      72    71    143
18             Equestrian      73   125    198
19                Fencing     107   108    215
20               Football     264   344    608
21                   Golf      60    60    120
22               Handball     168   168    336
23                 Hockey     192   192    384
24                   Judo     192   201    393
25                 Karate      40    42     82
26      Marathon Swimming      25    25     50
27      Modern Pentathlon      36    36     72
28    Rhythmic Gymnastics      96     0     96
29                 Rowing     257   265    522
30           Rugby Sevens     146   151    297
31                Sailing     175   175    350
32               Shooting     178   178    356
33          Skateboarding      40    40     80
34         Sport Climbing      20    20     40
35                Surfing      20    20     40
36               Swimming     361   418    779
37           Table Tennis      86    86    172
38              Taekwondo      65    65    130
39                 Tennis      94    97    191
40  Trampoline Gymnastics      16    16     32
41              Triathlon      55    55    110
42             Volleyball     144   144    288
43             Water Polo     122   146    268
44          Weightlifting      98    99    197
45              Wrestling      96   193    289

In [32]:
gen.isnull().sum()

Discipline    0
Female        0
Male          0
Total         0
dtype: int64

In [33]:
gen.shape

(46, 4)

In [34]:
gen.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Discipline  46 non-null     object
 1   Female      46 non-null     int64
 2   Male        46 non-null     int64
 3   Total       46 non-null     int64
dtypes: int64(3), object(1)
memory usage: 1.6+ KB

In [35]:
gen.describe

<bound method NDFrame.describe of                Discipline  Female  Male  Total
0          3x3 Basketball      32    32     64
1                 Archery      64    64    128
2     Artistic Gymnastics      98    98    196
3       Artistic Swimming     105     0    105
4               Athletics     969  1072   2041
5               Badminton      86    87    173
6       Baseball/Softball      90   144    234
7              Basketball     144   144    288
8        Beach Volleyball      48    48     96
9                  Boxing     102   187    289
10           Canoe Slalom      41    41     82
11           Canoe Sprint     123   126    249
12  Cycling BMX Freestyle      10     9     19
13     Cycling BMX Racing      24    24     48
14  Cycling Mountain Bike      38    38     76
15           Cycling Road      70   131    201
16          Cycling Track      90    99    189
17                 Diving      72    71    143
18             Equestrian      73   125    198
19                Fencing     107   108    215
20               Football     264   344    608
21                   Golf      60    60    120
22               Handball     168   168    336
23                 Hockey     192   192    384
24                   Judo     192   201    393
25                 Karate      40    42     82
26      Marathon Swimming      25    25     50
27      Modern Pentathlon      36    36     72
28    Rhythmic Gymnastics      96     0     96
29                 Rowing     257   265    522
30           Rugby Sevens     146   151    297
31                Sailing     175   175    350
32               Shooting     178   178    356
33          Skateboarding      40    40     80
34         Sport Climbing      20    20     40
35                Surfing      20    20     40
36               Swimming     361   418    779
37           Table Tennis      86    86    172
38              Taekwondo      65    65    130
39                 Tennis      94    97    191
40  Trampoline Gymnastics      16    16     32
41              Triathlon      55    55    110
42             Volleyball     144   144    288
43             Water Polo     122   146    268
44          Weightlifting      98    99    197
45              Wrestling      96   193    289>

### Loading Medals table

In [36]:
med = pd.read_excel('/Users/nikita/My_jupyter_data/olympics_kaggle/Medals.xlsx')
med

,Rank,Team/NOC,Gold,Silver,Bronze,Total,Rank by Total
0,1,United States of America,39,41,33,113,1
1,2,People's Republic of China,38,32,18,88,2
2,3,Japan,27,14,17,58,5
3,4,Great Britain,22,21,22,65,4
4,5,ROC,20,28,23,71,3
...,...,...,...,...,...,...,...
88,86,Ghana,0,0,1,1,77
89,86,Grenada,0,0,1,1,77
90,86,Kuwait,0,0,1,1,77
91,86,Republic of Moldova,0,0,1,1,77
92,86,Syrian Arab Republic,0,0,1,1,77

In [37]:
med.shape

(93, 7)

In [38]:
med.isnull().sum()

Rank             0
Team/NOC         0
Gold             0
Silver           0
Bronze           0
Total            0
Rank by Total    0
dtype: int64

### Loading Teams table

In [39]:
team = pd.read_excel('/Users/nikita/My_jupyter_data/olympics_kaggle/Teams.xlsx')
team

              Name      Discipline                         NOC  Event
0          Belgium  3x3 Basketball                     Belgium    Men
1            China  3x3 Basketball  People's Republic of China    Men
2            China  3x3 Basketball  People's Republic of China  Women
3           France  3x3 Basketball                      France  Women
4            Italy  3x3 Basketball                       Italy  Women
..             ...             ...                         ...    ...
738   South Africa      Water Polo                South Africa  Women
739          Spain      Water Polo                       Spain    Men
740          Spain      Water Polo                       Spain  Women
741  United States      Water Polo    United States of America    Men
742  United States      Water Polo    United States of America  Women

[743 rows x 4 columns]

In [40]:
team.shape

(743, 4)

In [41]:
team.isnull().sum()

Name          0
Discipline    0
NOC           0
Event         0
dtype: int64

## SQL QUERIES

In [42]:
import pandasql as ps

### Which field is dominated by a particular gender

In [43]:
ps.sqldf("""

SELECT *
FROM gen
LIMIT 3;


""")

            Discipline  Female  Male  Total
0       3x3 Basketball      32    32     64
1              Archery      64    64    128
2  Artistic Gymnastics      98    98    196

### To find maximum number of females and males

In [44]:
ps.sqldf("""

SELECT *, MAX(Female) total_female
FROM gen;


""")

  Discipline  Female  Male  Total  total_female
0  Athletics     969  1072   2041           969

In [45]:
ps.sqldf("""

SELECT *, MAX(Male) total_male
FROM gen;


""")

  Discipline  Female  Male  Total  total_male
0  Athletics     969  1072   2041        1072

### To find minimun number of females and males

In [46]:
ps.sqldf("""

SELECT *, MIN(Female) min_female
FROM gen;

""")

              Discipline  Female  Male  Total  min_female
0  Cycling BMX Freestyle      10     9     19          10

In [47]:
ps.sqldf("""

SELECT *, MIN(Male) min_male
FROM gen;

""")

          Discipline  Female  Male  Total  min_male
0  Artistic Swimming     105     0    105         0

### To find difference in the number of males and females

In [48]:
ps.sqldf("""

SELECT Discipline, MAX(difference)
FROM
(SELECT Discipline, Female, Male, abs(Female-Male) AS difference 
FROM gen) sub


""")

          Discipline  MAX(difference)
0  Artistic Swimming              105

### Most player under a single coach group by respective discipline and country

In [49]:
ps.sqldf("""

SELECT c.Discipline, c.NOC, c.Name ,  MAX(g.Total) total_players
FROM coach c
INNER JOIN gen g
ON c.Discipline = g.Discipline
GROUP BY 1,2 
ORDER BY 4 DESC;

""")

,Discipline,NOC,Name,total_players
0,Football,Argentina,BATISTA Fernando,608
1,Football,Australia,ARNOLD Graham,608
2,Football,Brazil,JARDINE Andre,608
3,Football,Canada,PRIESTMAN Bev,608
4,Football,Chile,CASTRO Alex,608
...,...,...,...,...
156,Artistic Swimming,Serbia,KONTIC Svetlana,105
157,Artistic Swimming,Slovakia,SZAUDER Nora,105
158,Artistic Swimming,Spain,DIDENKO Natalia,105
159,Artistic Swimming,Ukraine,FEDIUSHYNA Tetiana,105
160,Artistic Swimming,United States of America,FUENTES Andrea,105

### Gender representation of country in all fields

In [50]:
ps.sqldf("""

SELECT COUNT(g.Female) fem_no, COUNT(g.Male) male_no, t.NOC, g.Discipline
FROM gen g
INNER JOIN team t
ON g.Discipline = t.Discipline
GROUP BY 4,3
order by 1 desc;

""")

     fem_no  male_no                         NOC  Discipline
0         7        7                   Australia    Swimming
1         7        7                     Germany    Swimming
2         7        7                       Japan    Swimming
3         7        7                         ROC    Swimming
4         7        7    United States of America    Swimming
..      ...      ...                         ...         ...
395       1        1                  Montenegro  Water Polo
396       1        1                 Netherlands  Water Polo
397       1        1  People's Republic of China  Water Polo
398       1        1                         ROC  Water Polo
399       1        1                      Serbia  Water Polo

[400 rows x 4 columns]

### Total number of players in each countries

In [51]:
ps.sqldf("""

SELECT NOC, COUNT(Name)
FROM athlete
GROUP BY 1
ORDER BY 2 DESC;

""")

                          NOC  COUNT(Name)
0    United States of America          615
1                       Japan          586
2                   Australia          470
3                       China          401
4                     Germany          400
..                        ...          ...
201                  Dominica            2
202  Central African Republic            2
203         Brunei Darussalam            2
204                   Bermuda            2
205                   Andorra            2

[206 rows x 2 columns]

In [52]:
ps.sqldf("""

SELECT *
FROM gen g
INNER JOIN team t
ON g.Discipline  = t.Discipline
WHERE NOC = 'India' GROUP BY g.Discipline

""")

,Discipline,Female,Male,Total,Name,Discipline,NOC,Event
0,Archery,64,64,128,India,Archery,India,Men's Team
1,Athletics,969,1072,2041,India,Athletics,India,4 x 400m Relay Mixed
2,Hockey,192,192,384,India,Hockey,India,Men
3,Table Tennis,86,86,172,ACHANTA Kamal / BATRA Manika,Table Tennis,India,Mixed Doubles

In [53]:
ps.sqldf("""

SELECT count(*), Name, NOC, Discipline
FROM athlete
GROUP BY 2,3,4 having count(*) >= 1;

""")

,count(*),Name,NOC,Discipline
0,1,AALERUD Katrine,Norway,Cycling Road
1,1,ABAD Nestor,Spain,Artistic Gymnastics
2,1,ABAGNALE Giovanni,Italy,Rowing
3,1,ABALDE Alberto,Spain,Basketball
4,1,ABALDE Tamara,Spain,Basketball
...,...,...,...,...
11079,1,van der WEERDEN Mink Alphons Louis,Netherlands,Hockey
11080,1,van der WESTHUYZEN Jean,Australia,Canoe Sprint
11081,1,von BREDOW-WERNDL Jessica,Germany,Equestrian
11082,1,von ECKERMANN Henrik,Sweden,Equestrian
11083,1,von MARTELS Chris,Canada,Equestrian

### Coaches who have coached for more than one country

In [55]:
ps.sqldf("""

SELECT Name, NOC
FROM coach
WHERE Name = 'CHEPAK Anastasiya';
""")

                Name    NOC
0  CHEPAK Anastasiya  Egypt
1  CHEPAK Anastasiya  Egypt

### Finding the duplicates in coach column

In [56]:
ps.sqldf("""

SELECT Name, NOC
FROM
(SELECT DISTINCT Name,NOC
FROM coach)

GROUP BY NAME HAVING (COUNT(*) > 1)

""")

Empty DataFrame
Columns: [Name, NOC]
Index: []

### Coaches who have more coached for more than one discipline

In [57]:
ps.sqldf("""

SELECT Name, Discipline
FROM
(SELECT DISTINCT Name, Discipline
FROM coach) 
GROUP BY Name, Discipline
HAVING count(*) > 1

""")

Empty DataFrame
Columns: [Name, Discipline]
Index: []

### Country with highest number of medals

In [73]:
ps.sqldf("""

SELECT m.'Team/NOC', (m.Gold + m.Silver + m.Bronze) AS Total_medals
FROM med m
ORDER BY 2 DESC
LIMIT 1;
""")

                   Team/NOC  Total_medals
0  United States of America           113

### Country with highest number of gold medals

In [72]:
ps.sqldf("""

SELECT m.'Team/NOC', MAX(m.Gold) max_gold_medals
FROM med m
ORDER BY 2 DESC
LIMIT 1

""")

                   Team/NOC  max_gold_medals
0  United States of America               39

### Maximum silver medals

In [66]:
ps.sqldf("""

SELECT m.'Team/NOC', MAX(m.Silver) max_silver_medals, m.Rank
FROM med m
ORDER BY 2 DESC
LIMIT 1;


""")

                   Team/NOC  max_silver_medals  Rank
0  United States of America                 41     1

### Maximum Bronze medals

In [67]:
ps.sqldf("""

SELECT m.'Team/NOC', MAX(m.Bronze) max_bronze_medals, m.Rank
FROM med m
ORDER BY 2 DESC
LIMIT 1;

""")

                   Team/NOC  max_bronze_medals  Rank
0  United States of America                 33     1

### Second highest country in terms of total medals

In [81]:
ps.sqldf("""

SELECT "Team/NOC", Total_medals	
FROM
(SELECT m.'Team/NOC' , (m.Gold + m.Silver + m.Bronze) AS Total_medals
FROM med m
ORDER BY 2 DESC
LIMIT 2) sub
ORDER BY 2;

""")

                     Team/NOC  Total_medals
0  People's Republic of China            88
1    United States of America           113

### To get second and third highest country

In [95]:
ps.sqldf("""

SELECT "Team/NOC", Total_medals, Rank
FROM
(SELECT "Team/NOC", Total_medals, Rank
FROM
(SELECT m.'Team/NOC' , (m.Gold + m.Silver + m.Bronze) AS Total_medals, m.Rank
FROM med m
ORDER BY 2 DESC
LIMIT 3) sub
ORDER BY 2
LIMIT 2)
ORDER BY 2 DESC
LIMIT 2;

""")

                     Team/NOC  Total_medals  Rank
0  People's Republic of China            88     2
1                         ROC            71     5

# Countries who have equal number of total medals

In [129]:
ps.sqldf("""
SELECT (m.Gold + m.Silver + m.Bronze) AS Total_medals, GROUP_CONCAT(m."Team/NOC", "," )
FROM med m
GROUP BY Total_medals 
HAVING COUNT(*) > 1
""")

    Total_medals                   GROUP_CONCAT(m."Team/NOC", "," )
0              1  Bermuda,Morocco,Puerto Rico,Bahrain,Saudi Arab...
1              2  Bahamas,Kosovo,Tunisia,Estonia,Fiji,Latvia,Tha...
2              3  Ecuador,Qatar,South Africa,Kyrgyzstan,Argentin...
3              4  Greece,Uganda,Ireland,Israel,Romania,Venezuela...
4              5  Slovenia,Uzbekistan,Indonesia,Colombia,Dominic...
5              6                    Bulgaria,Hong Kong, China,Egypt
6              7  Islamic Republic of Iran,Belgium,Belarus,India...
7              8                  Norway,Croatia,Georgia,Kazakhstan
8              9                              Jamaica,Sweden,Serbia
9             11                             Czech Republic,Denmark
10            13                                 Switzerland,Turkey
11            20              New Zealand,Hungary,Republic of Korea

# OR you can also do this way

In [125]:
ps.sqldf("""

SELECT n."Team/NOC", (n.Gold + n.Silver + n.Bronze) total
FROM med n
JOIN (SELECT 'Team/NOC', (Gold + Silver + Bronze) AS Total_medals
FROM med 
GROUP BY Total_medals having count(*) > 1) sub
ON n.total = sub.Total_medals

""")

             Team/NOC  total
0             Bahrain      1
1             Bermuda      1
2            Botswana      1
3        Burkina Faso      1
4       Côte d'Ivoire      1
..                ...    ...
70        Switzerland     13
71             Turkey     13
72            Hungary     20
73        New Zealand     20
74  Republic of Korea     20

[75 rows x 2 columns]

In [133]:
ps.sqldf("""

SELECT *, count()
FROM med 
""")

,Rank,Team/NOC,Gold,Silver,Bronze,Total,Rank by Total,count()
0,1,United States of America,39,41,33,113,1,93

# Coaches who have more coached for more than one discipline

In [135]:
ps.sqldf("""

SELECT Name, Discipline
FROM
(SELECT DISTINCT Name, Discipline
FROM coach) 
GROUP BY Name, Discipline
HAVING count(*) > 1

""")

Empty DataFrame
Columns: [Name, Discipline]
Index: []

# Finding duplicates in coach column

In [138]:
ps.sqldf("""

SELECT Name, NOC
FROM
(SELECT DISTINCT Name, NOC
FROM coach)

GROUP BY NAME HAVING (COUNT(*) > 1)

""")

Empty DataFrame
Columns: [Name, NOC]
Index: []

# Countries having equal number of gold medals

In [143]:
ps.sqldf("""

SELECT n."Team/NOC", n.Gold
FROM med n
JOIN(SELECT "Team/NOC", Gold
FROM med
GROUP BY Gold HAVING COUNT(*) >1) sub
ON n.Gold = sub.Gold

""")

                Team/NOC  Gold
0            Netherlands    10
1                 France    10
2                Germany    10
3                  Italy    10
4                 Canada     7
..                   ...   ...
82                 Ghana     0
83               Grenada     0
84                Kuwait     0
85   Republic of Moldova     0
86  Syrian Arab Republic     0

[87 rows x 2 columns]

# OR

In [146]:
ps.sqldf("""

SELECT Gold, GROUP_CONCAT("Team/NOC", ",")
FROM med
GROUP BY Gold HAVING COUNT(*) > 1;


""")

   Gold                      GROUP_CONCAT("Team/NOC", ",")
0     0  Colombia,Azerbaijan,Dominican Republic,Armenia...
1     1  Ukraine,Belarus,Romania,Venezuela,India,Hong K...
2     2  Georgia,Chinese Taipei,Turkey,Greece,Uganda,Ec...
3     3  Spain,Sweden,Switzerland,Denmark,Croatia,Islam...
4     4         Poland,Czech Republic,Kenya,Norway,Jamaica
5     6                          Hungary,Republic of Korea
6     7                     Canada,Brazil,New Zealand,Cuba
7    10                   Netherlands,France,Germany,Italy

In [ ]:
it has 93 rows, having works the same but only operates on that group instead of the whole table.
hearing and back is redundancy